{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "**Extra resource: Knowledge Graphs for RAG (`www.deeplearning.ai`)**\n",
    "\n",
    "**Start the Movie Neo4j DB**"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain_community.graphs import Neo4jGraph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "NEO4J_URL = \"neo4j://localhost:7687\"\n",
    "NEO4J_USERNAME = \"neo4j\"\n",
    "NEO4J_PASSWORD = \"fireinthehole\"\n",
    "NEO4J_DATABASE = 'neo4j'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "graph = Neo4jGraph(url=NEO4J_URL, username=NEO4J_USERNAME, password=NEO4J_PASSWORD, database=NEO4J_DATABASE)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'count(n)': 155}]"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Match all nodes in the graph\n",
    "cypher = \"\"\"\n",
    "  MATCH (n) \n",
    "  RETURN count(n)\n",
    "  \"\"\"\n",
    "result = graph.query(cypher)\n",
    "result"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'numberOfNodes': 155}]"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "  MATCH (n) \n",
    "  RETURN count(n) AS numberOfNodes\n",
    "  \"\"\"\n",
    "result = graph.query(cypher)\n",
    "result"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'numberOfMovies': 20}]"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Match only the Movie nodes by specifying the node label\n",
    "\n",
    "cypher = \"\"\"\n",
    "  MATCH (m:Movie) \n",
    "  RETURN count(m) AS numberOfMovies\n",
    "  \"\"\"\n",
    "graph.query(cypher)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'numberOfPeople': 101}]"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Match only the Person nodes\n",
    "\n",
    "cypher = \"\"\"\n",
    "  MATCH (people:Person) \n",
    "  RETURN count(people) AS numberOfPeople\n",
    "  \"\"\"\n",
    "graph.query(cypher)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'tom': {'name': 'Tom Hanks'}}]"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Match a single person by specifying the value of the `name` property on the `Person` node\n",
    "cypher = \"\"\"\n",
    "  MATCH (tom:Person {name:\"Tom Hanks\"}) \n",
    "  RETURN tom\n",
    "  \"\"\"\n",
    "graph.query(cypher)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Match a single Movie by specifying the value of the title property\n",
    "\n",
    "cypher = \"\"\"\n",
    "  MATCH (cloudAtlas:Movie {title:\"Cloud Atlas\"}) \n",
    "  RETURN cloudAtlas\n",
    "  \"\"\"\n",
    "graph.query(cypher)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'Casino': {'taglineEmbedding': [0.002613685093820095,\n",
       "    -0.03336147218942642,\n",
       "    0.01993551291525364,\n",
       "    -0.012328702956438065,\n",
       "    -0.006651335395872593,\n",
       "    0.019701268523931503,\n",
       "    -0.020699892193078995,\n",
       "    0.002878752304241061,\n",
       "    -0.008112287148833275,\n",
       "    -0.0061273653991520405,\n",
       "    0.020182088017463684,\n",
       "    0.015028689056634903,\n",
       "    0.011077339760959148,\n",
       "    0.006830101832747459,\n",
       "    -0.010072550736367702,\n",
       "    -0.011256106197834015,\n",
       "    0.02357248030602932,\n",
       "    0.011360900476574898,\n",
       "    0.0048667555674910545,\n",
       "    -0.02675328589975834,\n",
       "    -0.007261606398969889,\n",
       "    0.004435251001268625,\n",
       "    -0.009357485920190811,\n",
       "    0.011693774722516537,\n",
       "    -0.002934231422841549,\n",
       "    0.0028294373769313097,\n",
       "    0.022746456786990166,\n",
       "    -0.0236094668507576,\n",
       "    0.04623263701796532,\n",
       "    -0.019602637737989426,\n",
       "    0.04048746079206467,\n",
       "    0.015090332366526127,\n",
       "    0.00838351808488369,\n",
       "    -0.0308710727840662,\n",
       "    -0.040092941373586655,\n",
       "    -0.0070150322280824184,\n",
       "    -0.025471100583672523,\n",
       "    -0.020749207586050034,\n",
       "    0.005193466320633888,\n",
       "    -0.0026938216760754585,\n",
       "    0.004475319292396307,\n",
       "    -0.011317749507725239,\n",
       "    -0.006235241889953613,\n",
       "    -0.014991703443229198,\n",
       "    -0.04455593228340149,\n",
       "    0.009154061786830425,\n",
       "    0.009856798686087132,\n",
       "    -0.022376596927642822,\n",
       "    -0.009480772539973259,\n",
       "    -0.002263858215883374,\n",
       "    0.013006782159209251,\n",
       "    0.009388307109475136,\n",
       "    -0.011114326305687428,\n",
       "    -0.033780645579099655,\n",
       "    0.005677368026226759,\n",
       "    -0.014325953088700771,\n",
       "    -0.011268435046076775,\n",
       "    0.01412869431078434,\n",
       "    -0.0061581870540976524,\n",
       "    0.013919105753302574,\n",
       "    0.006614349316805601,\n",
       "    -0.004216416738927364,\n",
       "    -0.00040607666596770287,\n",
       "    -0.0012760207755491138,\n",
       "    0.013931434601545334,\n",
       "    0.0012066718190908432,\n",
       "    -0.021735504269599915,\n",
       "    0.019060175865888596,\n",
       "    0.0026891983579844236,\n",
       "    0.0006068033399060369,\n",
       "    0.024361517280340195,\n",
       "    0.02359713800251484,\n",
       "    0.02254919894039631,\n",
       "    0.006491062231361866,\n",
       "    -0.005452368874102831,\n",
       "    -0.005091754253953695,\n",
       "    -0.020083457231521606,\n",
       "    0.011219119653105736,\n",
       "    -0.002935772528871894,\n",
       "    -0.0037664189003407955,\n",
       "    0.01251979824155569,\n",
       "    -0.009807483293116093,\n",
       "    -0.03602446988224983,\n",
       "    0.0044938125647604465,\n",
       "    0.018949216231703758,\n",
       "    0.0012837261892855167,\n",
       "    -0.013573902659118176,\n",
       "    0.01338897179812193,\n",
       "    -0.0209587961435318,\n",
       "    -0.002441083313897252,\n",
       "    0.007791740354150534,\n",
       "    0.012464319355785847,\n",
       "    0.01722319796681404,\n",
       "    0.022265637293457985,\n",
       "    -0.018961545079946518,\n",
       "    0.012920481152832508,\n",
       "    -0.019725924357771873,\n",
       "    0.013536916114389896,\n",
       "    0.010165016166865826,\n",
       "    -0.03496420383453369,\n",
       "    0.006296885199844837,\n",
       "    -0.006786951329559088,\n",
       "    -0.005936270579695702,\n",
       "    -0.007021196652203798,\n",
       "    0.0020743042696267366,\n",
       "    0.0011696857400238514,\n",
       "    -0.011928020045161247,\n",
       "    0.002878752304241061,\n",
       "    -0.0028833753895014524,\n",
       "    0.014079378917813301,\n",
       "    0.007107497658580542,\n",
       "    0.014387596398591995,\n",
       "    0.02778889797627926,\n",
       "    -0.020231401547789574,\n",
       "    0.0014393761521205306,\n",
       "    -0.014486226253211498,\n",
       "    -0.013043767772614956,\n",
       "    -0.019516337662935257,\n",
       "    0.006694485899060965,\n",
       "    -0.02516288310289383,\n",
       "    0.0287258792668581,\n",
       "    0.0014301296323537827,\n",
       "    0.012710893526673317,\n",
       "    -0.017136897891759872,\n",
       "    0.00890748854726553,\n",
       "    0.0002529310586396605,\n",
       "    -0.03550666570663452,\n",
       "    -0.015879370272159576,\n",
       "    0.004820522852241993,\n",
       "    0.019676610827445984,\n",
       "    0.023313578218221664,\n",
       "    0.0325724333524704,\n",
       "    -0.012119115330278873,\n",
       "    -0.015620467253029346,\n",
       "    -0.010257480666041374,\n",
       "    0.0067006503231823444,\n",
       "    -0.0002219166635768488,\n",
       "    -0.01829579472541809,\n",
       "    -0.011915692128241062,\n",
       "    -0.011083504185080528,\n",
       "    0.013475272804498672,\n",
       "    -0.0021020439453423023,\n",
       "    -0.0006657500052824616,\n",
       "    -0.0012814146466553211,\n",
       "    0.01359855942428112,\n",
       "    0.011416379362344742,\n",
       "    -0.014190337620675564,\n",
       "    0.008241738192737103,\n",
       "    0.005680450238287449,\n",
       "    0.004164019599556923,\n",
       "    0.002650671172887087,\n",
       "    -0.012858837842941284,\n",
       "    0.01618758775293827,\n",
       "    -0.016372518613934517,\n",
       "    -0.0037294328212738037,\n",
       "    0.01666840724647045,\n",
       "    -0.002467281650751829,\n",
       "    -0.007286263629794121,\n",
       "    -0.02358480915427208,\n",
       "    -0.011835555545985699,\n",
       "    -0.0060379826463758945,\n",
       "    0.009197212755680084,\n",
       "    0.023757411167025566,\n",
       "    0.012507469393312931,\n",
       "    0.004432168789207935,\n",
       "    0.018086208030581474,\n",
       "    0.0058129834942519665,\n",
       "    0.021649202331900597,\n",
       "    -0.004130115732550621,\n",
       "    0.03309024125337601,\n",
       "    0.004160937387496233,\n",
       "    0.026556026190519333,\n",
       "    -0.029169712215662003,\n",
       "    0.012735550291836262,\n",
       "    -0.0014501637779176235,\n",
       "    0.02776424027979374,\n",
       "    -0.014880744740366936,\n",
       "    0.028528619557619095,\n",
       "    -0.012137608602643013,\n",
       "    -0.023893026635050774,\n",
       "    -0.00863009225577116,\n",
       "    -0.001402389956638217,\n",
       "    0.03259709104895592,\n",
       "    0.04961070045828819,\n",
       "    -0.005936270579695702,\n",
       "    -0.004170184023678303,\n",
       "    0.02254919894039631,\n",
       "    0.012186923064291477,\n",
       "    0.008019821718335152,\n",
       "    -0.0038126513827592134,\n",
       "    0.010787615552544594,\n",
       "    0.020268388092517853,\n",
       "    -0.007249277550727129,\n",
       "    0.007656124886125326,\n",
       "    -0.6817280054092407,\n",
       "    -0.01359855942428112,\n",
       "    -7.883628131821752e-05,\n",
       "    0.009579402394592762,\n",
       "    0.014893073588609695,\n",
       "    -0.0037756653036922216,\n",
       "    0.001989544602110982,\n",
       "    0.015583480708301067,\n",
       "    -0.009449951350688934,\n",
       "    0.0027323488611727953,\n",
       "    -0.008204751648008823,\n",
       "    0.005119494162499905,\n",
       "    -0.005193466320633888,\n",
       "    -0.0035691596567630768,\n",
       "    -0.03493954613804817,\n",
       "    -0.02566836029291153,\n",
       "    0.002653753384947777,\n",
       "    -0.026062877848744392,\n",
       "    0.012581441551446915,\n",
       "    0.0048944950103759766,\n",
       "    -0.003566077444702387,\n",
       "    0.022647827863693237,\n",
       "    -0.007952013984322548,\n",
       "    0.008765707723796368,\n",
       "    0.010263645090162754,\n",
       "    0.013573902659118176,\n",
       "    0.002316255122423172,\n",
       "    -0.005661956965923309,\n",
       "    -0.01776566170156002,\n",
       "    0.011114326305687428,\n",
       "    0.00019205808348488063,\n",
       "    0.020527290180325508,\n",
       "    -0.007409550715237856,\n",
       "    0.021735504269599915,\n",
       "    0.04354498162865639,\n",
       "    -0.022697143256664276,\n",
       "    -0.010670492425560951,\n",
       "    0.01615060120820999,\n",
       "    0.006990374531596899,\n",
       "    0.01724785566329956,\n",
       "    -0.01386979129165411,\n",
       "    -0.0032948460429906845,\n",
       "    0.01943003572523594,\n",
       "    -0.012581441551446915,\n",
       "    0.010787615552544594,\n",
       "    -0.007310920860618353,\n",
       "    -0.005011617671698332,\n",
       "    -0.020712221041321754,\n",
       "    -0.00016085105016827583,\n",
       "    -0.00524586346000433,\n",
       "    0.004056143574416637,\n",
       "    0.015916356816887856,\n",
       "    -0.013561573810875416,\n",
       "    0.0011342406505718827,\n",
       "    -0.005008535925298929,\n",
       "    0.019060175865888596,\n",
       "    -0.003683200106024742,\n",
       "    -0.005732846911996603,\n",
       "    -0.016619091853499413,\n",
       "    0.020305374637246132,\n",
       "    -0.0035845704842358828,\n",
       "    0.009191048331558704,\n",
       "    -0.010910902172327042,\n",
       "    0.0013669449836015701,\n",
       "    -0.026925887912511826,\n",
       "    0.030476555228233337,\n",
       "    -0.021575231105089188,\n",
       "    0.03905733302235603,\n",
       "    0.020810851827263832,\n",
       "    -0.02712314762175083,\n",
       "    -0.011157476343214512,\n",
       "    0.006934895645827055,\n",
       "    0.007520508952438831,\n",
       "    -0.01621224544942379,\n",
       "    0.006731471978127956,\n",
       "    0.016483476385474205,\n",
       "    0.01361088827252388,\n",
       "    -0.003248613327741623,\n",
       "    0.006768458057194948,\n",
       "    0.014067050069570541,\n",
       "    -0.0034890230745077133,\n",
       "    -0.018036892637610435,\n",
       "    -0.003381146816536784,\n",
       "    0.01044241152703762,\n",
       "    0.014893073588609695,\n",
       "    -0.0005459304084070027,\n",
       "    -0.03032861091196537,\n",
       "    -0.02924368344247341,\n",
       "    -0.021082082763314247,\n",
       "    0.005674285814166069,\n",
       "    0.0019356063567101955,\n",
       "    0.03092038817703724,\n",
       "    0.010380768217146397,\n",
       "    0.0025612881872802973,\n",
       "    0.015928683802485466,\n",
       "    -0.004832851700484753,\n",
       "    -0.02248755469918251,\n",
       "    -0.0005336016765795648,\n",
       "    0.02033003233373165,\n",
       "    -0.025014938786625862,\n",
       "    -0.008112287148833275,\n",
       "    -0.012593770399689674,\n",
       "    0.00473422184586525,\n",
       "    0.0034859408624470234,\n",
       "    0.0172355268150568,\n",
       "    0.013228698633611202,\n",
       "    -0.00032497692154720426,\n",
       "    0.00865474995225668,\n",
       "    0.054147664457559586,\n",
       "    -0.017186211422085762,\n",
       "    0.006484897807240486,\n",
       "    -0.014030064456164837,\n",
       "    -0.0009940017480403185,\n",
       "    0.0038342266343533993,\n",
       "    -0.015028689056634903,\n",
       "    -0.019158804789185524,\n",
       "    0.01669306494295597,\n",
       "    -0.003233202500268817,\n",
       "    -0.010165016166865826,\n",
       "    -0.0219081062823534,\n",
       "    0.006786951329559088,\n",
       "    0.013043767772614956,\n",
       "    0.016964295879006386,\n",
       "    -0.021119069308042526,\n",
       "    0.024201244115829468,\n",
       "    0.020786194130778313,\n",
       "    0.007921191863715649,\n",
       "    0.0091232405975461,\n",
       "    -0.02303001843392849,\n",
       "    0.0131300687789917,\n",
       "    -0.015398550778627396,\n",
       "    0.011669117957353592,\n",
       "    0.04647921025753021,\n",
       "    0.006238323636353016,\n",
       "    0.03249846026301384,\n",
       "    -0.0015904026804491878,\n",
       "    -0.004392100498080254,\n",
       "    -0.017519086599349976,\n",
       "    0.029440943151712418,\n",
       "    -0.012149937450885773,\n",
       "    0.006179762538522482,\n",
       "    -0.0172971710562706,\n",
       "    -0.017161555588245392,\n",
       "    0.011823226697742939,\n",
       "    -0.02348618023097515,\n",
       "    -0.03079710155725479,\n",
       "    -0.029613545164465904,\n",
       "    0.011638295836746693,\n",
       "    -0.006423254497349262,\n",
       "    0.0009724264964461327,\n",
       "    0.003581488272175193,\n",
       "    0.004876002203673124,\n",
       "    0.004201005678623915,\n",
       "    0.015028689056634903,\n",
       "    0.005178055260330439,\n",
       "    0.004882166627794504,\n",
       "    -0.010029399767518044,\n",
       "    -0.01665607839822769,\n",
       "    -0.04509839788079262,\n",
       "    -0.019688939675688744,\n",
       "    -0.004620181396603584,\n",
       "    0.017075253650546074,\n",
       "    -0.019072504714131355,\n",
       "    -0.006118118762969971,\n",
       "    0.007988999597728252,\n",
       "    -0.02402864210307598,\n",
       "    -0.001967969350516796,\n",
       "    0.0026938216760754585,\n",
       "    0.008537626825273037,\n",
       "    -0.00261214398778975,\n",
       "    -0.00431504612788558,\n",
       "    -0.018172508105635643,\n",
       "    0.0005243551568128169,\n",
       "    0.007458865642547607,\n",
       "    -0.0026707053184509277,\n",
       "    0.003080634633079171,\n",
       "    -0.011965006589889526,\n",
       "    0.012569112703204155,\n",
       "    0.00656503438949585,\n",
       "    0.0003305633435957134,\n",
       "    0.01020816620439291,\n",
       "    -0.0042379917576909065,\n",
       "    0.007360235787928104,\n",
       "    -0.0277149248868227,\n",
       "    0.04795865714550018,\n",
       "    0.01830812357366085,\n",
       "    -0.007853384129703045,\n",
       "    0.0001817520533222705,\n",
       "    -0.012969795614480972,\n",
       "    0.02193276397883892,\n",
       "    0.0027493007946759462,\n",
       "    0.015867041423916817,\n",
       "    0.001332270447164774,\n",
       "    -0.01939305104315281,\n",
       "    0.02818341553211212,\n",
       "    -0.025471100583672523,\n",
       "    0.005661956965923309,\n",
       "    -0.007575988303869963,\n",
       "    0.008284888230264187,\n",
       "    0.021057425066828728,\n",
       "    0.004019157495349646,\n",
       "    0.009918441995978355,\n",
       "    -0.009936935268342495,\n",
       "    -0.01886291615664959,\n",
       "    -0.00202961266040802,\n",
       "    -0.03286832198500633,\n",
       "    -0.004931481089442968,\n",
       "    -0.021094411611557007,\n",
       "    0.014498555101454258,\n",
       "    0.022845087572932243,\n",
       "    0.002914197277277708,\n",
       "    -0.01020200178027153,\n",
       "    0.01358623057603836,\n",
       "    -0.016902651637792587,\n",
       "    0.00045385039993561804,\n",
       "    0.05695860832929611,\n",
       "    0.010023235343396664,\n",
       "    0.012932810001075268,\n",
       "    -0.013154726475477219,\n",
       "    -0.0024133436381816864,\n",
       "    -0.0030405663419514894,\n",
       "    -0.003840391058474779,\n",
       "    0.004385936073958874,\n",
       "    -0.01619991660118103,\n",
       "    0.01677936501801014,\n",
       "    0.008519133552908897,\n",
       "    0.01730949990451336,\n",
       "    0.0013846674701198936,\n",
       "    0.005985585507005453,\n",
       "    -0.022105364128947258,\n",
       "    -0.01940537802875042,\n",
       "    0.005492437165230513,\n",
       "    0.01541087869554758,\n",
       "    0.00108338485006243,\n",
       "    0.003963678143918514,\n",
       "    0.01730949990451336,\n",
       "    0.01873962953686714,\n",
       "    -0.008475983515381813,\n",
       "    0.027961498126387596,\n",
       "    -0.0024302955716848373,\n",
       "    -0.002627554815262556,\n",
       "    -0.005196548532694578,\n",
       "    -0.006121200975030661,\n",
       "    -0.014917731285095215,\n",
       "    0.017408128827810287,\n",
       "    -0.009597895666956902,\n",
       "    0.022808101028203964,\n",
       "    0.01781497709453106,\n",
       "    -0.03299161046743393,\n",
       "    0.022882074117660522,\n",
       "    -0.01337664294987917,\n",
       "    0.020095786079764366,\n",
       "    0.0010672033531591296,\n",
       "    -0.005464697722345591,\n",
       "    0.004623263608664274,\n",
       "    -0.02621082402765751,\n",
       "    0.01569443941116333,\n",
       "    -0.005640381947159767,\n",
       "    -0.004348949994891882,\n",
       "    0.023782068863511086,\n",
       "    0.0050270287320017815,\n",
       "    0.014214995317161083,\n",
       "    0.0022299541160464287,\n",
       "    -0.01776566170156002,\n",
       "    0.012131444178521633,\n",
       "    -0.003052895190194249,\n",
       "    6.880716682644561e-06,\n",
       "    -0.0131300687789917,\n",
       "    0.0006915631820447743,\n",
       "    -0.02098345384001732,\n",
       "    -0.02457110583782196,\n",
       "    0.005547916516661644,\n",
       "    0.028947794809937477,\n",
       "    0.005104083102196455,\n",
       "    0.021846462041139603,\n",
       "    -0.027098489925265312,\n",
       "    -0.015127318911254406,\n",
       "    -0.02724643424153328,\n",
       "    -0.00011529264156706631,\n",
       "    0.008432833477854729,\n",
       "    0.006111954804509878,\n",
       "    -0.030550526455044746,\n",
       "    -0.0009053891408257186,\n",
       "    0.028873823583126068,\n",
       "    0.0003236284537706524,\n",
       "    -0.04773673787713051,\n",
       "    -0.01020816620439291,\n",
       "    0.0074650296010077,\n",
       "    -0.009517759084701538,\n",
       "    0.008352696895599365,\n",
       "    -0.018160179257392883,\n",
       "    -0.01891223154962063,\n",
       "    -0.01153350155800581,\n",
       "    0.007397221866995096,\n",
       "    0.0025874865241348743,\n",
       "    0.01023282390087843,\n",
       "    0.005982503294944763,\n",
       "    -0.021057425066828728,\n",
       "    -0.008106122724711895,\n",
       "    0.000156805690494366,\n",
       "    0.01412869431078434,\n",
       "    -0.0017799565102905035,\n",
       "    0.018184836953878403,\n",
       "    -0.0023732753470540047,\n",
       "    0.0029927927535027266,\n",
       "    0.008198587223887444,\n",
       "    -0.007908863015472889,\n",
       "    -0.018604014068841934,\n",
       "    -0.038958702236413956,\n",
       "    0.010633506812155247,\n",
       "    -0.013709518127143383,\n",
       "    -0.02518754079937935,\n",
       "    -0.004672578535974026,\n",
       "    -0.023153305053710938,\n",
       "    -0.0008807317353785038,\n",
       "    -0.015312249772250652,\n",
       "    0.009289678186178207,\n",
       "    -0.014178008772432804,\n",
       "    0.03858884051442146,\n",
       "    -0.004872919991612434,\n",
       "    -0.019750582054257393,\n",
       "    0.01518896222114563,\n",
       "    -0.03927924856543541,\n",
       "    0.00036465993616729975,\n",
       "    0.12190622091293335,\n",
       "    0.018024563789367676,\n",
       "    -0.018147850409150124,\n",
       "    0.014227323234081268,\n",
       "    -0.020120443776249886,\n",
       "    -0.004620181396603584,\n",
       "    0.0006977275479584932,\n",
       "    -0.015817726030945778,\n",
       "    0.0021313244942575693,\n",
       "    -0.004829769488424063,\n",
       "    -0.004805112257599831,\n",
       "    -0.014905402436852455,\n",
       "    -0.00016239214164670557,\n",
       "    -0.008845844306051731,\n",
       "    0.027912184596061707,\n",
       "    0.011656789109110832,\n",
       "    0.0011704562930390239,\n",
       "    -0.002786286873742938,\n",
       "    -0.0016320120776072145,\n",
       "    0.008445161394774914,\n",
       "    -0.023868368938565254,\n",
       "    -0.007280099205672741,\n",
       "    0.019787568598985672,\n",
       "    0.003381146816536784,\n",
       "    -0.017383471131324768,\n",
       "    0.020034143701195717,\n",
       "    0.0022361185401678085,\n",
       "    0.011416379362344742,\n",
       "    -0.0026599178090691566,\n",
       "    -0.005714354105293751,\n",
       "    0.007317085284739733,\n",
       "    0.004876002203673124,\n",
       "    0.007255441974848509,\n",
       "    0.027345063164830208,\n",
       "    -0.014276638627052307,\n",
       "    0.004592441953718662,\n",
       "    -0.011878705583512783,\n",
       "    -0.0003064838529098779,\n",
       "    0.04909289628267288,\n",
       "    -0.02879985049366951,\n",
       "    0.0073294141329824924,\n",
       "    -0.00771160377189517,\n",
       "    0.018123194575309753,\n",
       "    0.0071383193135261536,\n",
       "    0.009363650344312191,\n",
       "    0.016138272359967232,\n",
       "    -0.009357485920190811,\n",
       "    0.01460951380431652,\n",
       "    -0.032276544719934464,\n",
       "    -0.02569301798939705,\n",
       "    0.016014985740184784,\n",
       "    -0.007828726433217525,\n",
       "    -0.012710893526673317,\n",
       "    -0.005930106155574322,\n",
       "    0.021230027079582214,\n",
       "    0.01945469342172146,\n",
       "    0.005396889988332987,\n",
       "    -0.015990328043699265,\n",
       "    -0.02934231422841549,\n",
       "    -0.001988003496080637,\n",
       "    -0.02778889797627926,\n",
       "    -0.022771114483475685,\n",
       "    -0.01726018451154232,\n",
       "    -0.015114990063011646,\n",
       "    -0.003103750990703702,\n",
       "    -0.01436293963342905,\n",
       "    -0.016446489840745926,\n",
       "    -0.0069842105731368065,\n",
       "    -0.020108114928007126,\n",
       "    -0.027640951797366142,\n",
       "    0.032745037227869034,\n",
       "    -0.0298601184040308,\n",
       "    0.002347076777368784,\n",
       "    -0.006589692085981369,\n",
       "    0.011471858248114586,\n",
       "    0.02505192533135414,\n",
       "    0.013573902659118176,\n",
       "    -0.003991417586803436,\n",
       "    -0.011447200551629066,\n",
       "    -0.0052797673270106316,\n",
       "    0.005658874753862619,\n",
       "    -0.03148750960826874,\n",
       "    -0.021562902256846428,\n",
       "    -0.020071128383278847,\n",
       "    -0.018184836953878403,\n",
       "    -0.0023840630892664194,\n",
       "    0.011262270621955395,\n",
       "    0.007008867803961039,\n",
       "    -0.018135523423552513,\n",
       "    0.005366067867726088,\n",
       "    0.018036892637610435,\n",
       "    0.0032054628245532513,\n",
       "    0.005695860832929611,\n",
       "    0.004358196631073952,\n",
       "    -0.009302007034420967,\n",
       "    -0.02194509096443653,\n",
       "    0.015225948765873909,\n",
       "    0.009801318868994713,\n",
       "    0.015854712575674057,\n",
       "    0.018986202776432037,\n",
       "    0.00033114125835709274,\n",
       "    -0.017617717385292053,\n",
       "    -0.018110865727066994,\n",
       "    -0.002461117459461093,\n",
       "    0.018579356372356415,\n",
       "    0.007945849560201168,\n",
       "    0.030649157240986824,\n",
       "    0.000498156645335257,\n",
       "    -0.002126701408997178,\n",
       "    -0.0011804733658209443,\n",
       "    0.0035845704842358828,\n",
       "    -0.01676703616976738,\n",
       "    -0.0033256676979362965,\n",
       "    -0.01771634630858898,\n",
       "    -0.00522737018764019,\n",
       "    0.0042965528555214405,\n",
       "    0.024472475051879883,\n",
       "    0.03987102583050728,\n",
       "    0.0010587273864075541,\n",
       "    -0.0038866237737238407,\n",
       "    -0.02505192533135414,\n",
       "    -0.02103276737034321,\n",
       "    0.015558823943138123,\n",
       "    0.022364268079400063,\n",
       "    0.0019463939825072885,\n",
       "    -0.016914980486035347,\n",
       "    0.006959552876651287,\n",
       "    -0.0071691409684717655,\n",
       "    -0.014436911791563034,\n",
       "    -0.0038989523891359568,\n",
       "    0.01389444898813963,\n",
       "    0.020687563344836235,\n",
       "    -0.008025986142456532,\n",
       "    -0.03782446309924126,\n",
       "    -0.03466831520199776,\n",
       "    0.0023979328107088804,\n",
       "    -0.013919105753302574,\n",
       "    -0.002613685093820095,\n",
       "    -0.018653327599167824,\n",
       "    -0.01337664294987917,\n",
       "    -0.0014794444432482123,\n",
       "    -0.014202666468918324,\n",
       "    0.00655886996537447,\n",
       "    -0.01615060120820999,\n",
       "    -0.011052682064473629,\n",
       "    -0.02616150863468647,\n",
       "    -0.0035075161140412092,\n",
       "    -0.0013723387382924557,\n",
       "    0.007347906939685345,\n",
       "    0.01202664989978075,\n",
       "    0.0037510080728679895,\n",
       "    -0.005794490687549114,\n",
       "    -0.025766989216208458,\n",
       "    0.011071175336837769,\n",
       "    0.030082035809755325,\n",
       "    -0.0099739208817482,\n",
       "    0.00012713974865619093,\n",
       "    -0.01931907795369625,\n",
       "    0.0062845563516020775,\n",
       "    0.020071128383278847,\n",
       "    0.02410261519253254,\n",
       "    -0.004025321453809738,\n",
       "    -0.010584191419184208,\n",
       "    0.001071056118234992,\n",
       "    0.013068425469100475,\n",
       "    0.0010209707543253899,\n",
       "    -0.030205322429537773,\n",
       "    -0.005917777772992849,\n",
       "    -0.0172971710562706,\n",
       "    0.014868415892124176,\n",
       "    -0.007384893484413624,\n",
       "    0.006266063544899225,\n",
       "    0.0002508120669517666,\n",
       "    -0.01336431410163641,\n",
       "    0.0027308077551424503,\n",
       "    0.014831430278718472,\n",
       "    -0.0056249708868563175,\n",
       "    -0.0022453651763498783,\n",
       "    -0.03612310066819191,\n",
       "    -0.028627248480916023,\n",
       "    -0.008593105711042881,\n",
       "    -0.03506283089518547,\n",
       "    -0.02677794359624386,\n",
       "    0.0041116224601864815,\n",
       "    0.0008969131740741432,\n",
       "    -0.017112240195274353,\n",
       "    0.021784817799925804,\n",
       "    0.017099911347031593,\n",
       "    0.011219119653105736,\n",
       "    0.0304272398352623,\n",
       "    0.01887524500489235,\n",
       "    0.007841055281460285,\n",
       "    0.016643749549984932,\n",
       "    0.0037633366882801056,\n",
       "    -0.024435490369796753,\n",
       "    -0.030008064582943916,\n",
       "    0.0009731969912536442,\n",
       "    -0.0013345821062102914,\n",
       "    0.008845844306051731,\n",
       "    -0.007804069202393293,\n",
       "    -0.012464319355785847,\n",
       "    0.018086208030581474,\n",
       "    -0.018986202776432037,\n",
       "    -0.003559913020581007,\n",
       "    0.006343117915093899,\n",
       "    0.013314999639987946,\n",
       "    -0.028627248480916023,\n",
       "    -0.046355925500392914,\n",
       "    0.017605388537049294,\n",
       "    -0.023350564762949944,\n",
       "    0.018936887383461,\n",
       "    -0.028035471215844154,\n",
       "    -0.01565745286643505,\n",
       "    -0.019257433712482452,\n",
       "    -0.0076129743829369545,\n",
       "    0.008821187540888786,\n",
       "    -0.031191619113087654,\n",
       "    -0.00026949774473905563,\n",
       "    -0.021784817799925804,\n",
       "    -0.02976148948073387,\n",
       "    0.012112950906157494,\n",
       "    0.003686282318085432,\n",
       "    0.04534497112035751,\n",
       "    0.009234198369085789,\n",
       "    0.03363270312547684,\n",
       "    0.010596520267426968,\n",
       "    -0.007218455895781517,\n",
       "    -0.015102661214768887,\n",
       "    0.011052682064473629,\n",
       "    0.015041017904877663,\n",
       "    -0.000929275993257761,\n",
       "    0.04068472236394882,\n",
       "    -0.0020881742238998413,\n",
       "    0.011508844792842865,\n",
       "    0.012562948279082775,\n",
       "    0.008334203623235226,\n",
       "    0.013968421146273613,\n",
       "    0.00021151431428734213,\n",
       "    -0.01933140680193901,\n",
       "    0.014067050069570541,\n",
       "    0.00365237845107913,\n",
       "    -0.007489687297493219,\n",
       "    -0.00998624972999096,\n",
       "    -0.01202048547565937,\n",
       "    0.021143727004528046,\n",
       "    0.02047797664999962,\n",
       "    -0.00021074377582408488,\n",
       "    -0.005356821697205305,\n",
       "    0.00041339683230035007,\n",
       "    -0.008106122724711895,\n",
       "    -0.007162976544350386,\n",
       "    -0.008494476787745953,\n",
       "    -0.02677794359624386,\n",
       "    0.020712221041321754,\n",
       "    0.02094646729528904,\n",
       "    -0.008722557686269283,\n",
       "    -0.006472569424659014,\n",
       "    -0.025791646912693977,\n",
       "    0.006534212734550238,\n",
       "    0.013647874817252159,\n",
       "    -0.023165633901953697,\n",
       "    0.018221823498606682,\n",
       "    -0.007317085284739733,\n",
       "    -9.685978511697613e-06,\n",
       "    -0.01737114228308201,\n",
       "    0.018135523423552513,\n",
       "    -0.02086016535758972,\n",
       "    -0.0020434826146811247,\n",
       "    -0.019577980041503906,\n",
       "    0.022734127938747406,\n",
       "    -0.00339655764400959,\n",
       "    -0.021698517724871635,\n",
       "    -0.0013099247589707375,\n",
       "    -0.0031376550905406475,\n",
       "    -0.00035907348501496017,\n",
       "    -0.0011088127503171563,\n",
       "    -0.0024010150227695704,\n",
       "    -0.022832758724689484,\n",
       "    0.016495805233716965,\n",
       "    -0.014054722152650356,\n",
       "    0.012445826083421707,\n",
       "    0.023288920521736145,\n",
       "    -0.004176348447799683,\n",
       "    -0.0034612833987921476,\n",
       "    -0.02574233151972294,\n",
       "    -0.03153682127594948,\n",
       "    -0.0118047334253788,\n",
       "    0.0035167625173926353,\n",
       "    0.015916356816887856,\n",
       "    -0.017050595954060555,\n",
       "    0.000983984675258398,\n",
       "    -0.0012398052494972944,\n",
       "    0.011317749507725239,\n",
       "    0.00912940502166748,\n",
       "    0.00564346369355917,\n",
       "    -0.023399878293275833,\n",
       "    -0.004034568089991808,\n",
       "    0.005128740333020687,\n",
       "    -0.010128029622137547,\n",
       "    0.012199251912534237,\n",
       "    -0.008556120097637177,\n",
       "    -0.008950638584792614,\n",
       "    -0.005982503294944763,\n",
       "    0.005822230130434036,\n",
       "    0.0012937432620674372,\n",
       "    0.00431812833994627,\n",
       "    0.012698564678430557,\n",
       "    -0.016335532069206238,\n",
       "    -0.01155815925449133,\n",
       "    -0.0024996446445584297,\n",
       "    -0.005199630744755268,\n",
       "    0.009154061786830425,\n",
       "    -0.006762293633073568,\n",
       "    0.0049869604408741,\n",
       "    -0.0029789230320602655,\n",
       "    -0.002336289267987013,\n",
       "    -0.00016518536722287536,\n",
       "    -0.023732753470540047,\n",
       "    0.0014178009005263448,\n",
       "    0.013216369785368443,\n",
       "    -0.012248566374182701,\n",
       "    0.012341031804680824,\n",
       "    0.02667931467294693,\n",
       "    -0.008580777794122696,\n",
       "    -0.0003561839403118938,\n",
       "    0.013919105753302574,\n",
       "    -0.005757504608482122,\n",
       "    -0.011323913931846619,\n",
       "    -0.018468396738171577,\n",
       "    -0.01337664294987917,\n",
       "    -0.0167916938662529,\n",
       "    0.006910237949341536,\n",
       "    -0.006694485899060965,\n",
       "    -0.032276544719934464,\n",
       "    -0.01734648458659649,\n",
       "    -0.009240362793207169,\n",
       "    -0.00772393262013793,\n",
       "    0.030624499544501305,\n",
       "    -0.008044478483498096,\n",
       "    -0.011317749507725239,\n",
       "    -0.0024195080623030663,\n",
       "    0.03545735031366348,\n",
       "    0.0060688043013215065,\n",
       "    -0.006170515902340412,\n",
       "    0.017457444220781326,\n",
       "    0.0027493007946759462,\n",
       "    0.015299920924007893,\n",
       "    -0.01617525890469551,\n",
       "    -0.0037849119398742914,\n",
       "    -0.021205369383096695,\n",
       "    -0.013956092298030853,\n",
       "    0.007027361076325178,\n",
       "    0.010251317173242569,\n",
       "    -0.010257480666041374,\n",
       "    -0.0112992562353611,\n",
       "    0.006978046149015427,\n",
       "    -0.04282991588115692,\n",
       "    -0.005415382795035839,\n",
       "    0.0057544223964214325,\n",
       "    0.0018878326518461108,\n",
       "    0.023399878293275833,\n",
       "    0.020786194130778313,\n",
       "    0.003074470441788435,\n",
       "    -0.0013515340397134423,\n",
       "    0.008229409344494343,\n",
       "    0.010109536349773407,\n",
       "    -0.005550998728722334,\n",
       "    0.010097208432853222,\n",
       "    -0.01205130759626627,\n",
       "    0.014412254095077515,\n",
       "    0.027098489925265312,\n",
       "    0.01152733713388443,\n",
       "    7.055293281155173e-06,\n",
       "    0.0037417614366859198,\n",
       "    -0.0009177178726531565,\n",
       "    0.01993551291525364,\n",
       "    0.007317085284739733,\n",
       "    0.014523212797939777,\n",
       "    -0.0005844575935043395,\n",
       "    0.011354736052453518,\n",
       "    0.014054722152650356,\n",
       "    0.004879084415733814,\n",
       "    0.018665656447410583,\n",
       "    0.024940967559814453,\n",
       "    0.019997157156467438,\n",
       "    -0.03173408284783363,\n",
       "    0.020305374637246132,\n",
       "    0.009332828223705292,\n",
       "    -0.017062924802303314,\n",
       "    -0.021094411611557007,\n",
       "    -0.016471147537231445,\n",
       "    0.010349946096539497,\n",
       "    0.004345867782831192,\n",
       "    0.01834511011838913,\n",
       "    -0.0033780646044760942,\n",
       "    -0.010824601165950298,\n",
       "    -0.012094457633793354,\n",
       "    -0.021082082763314247,\n",
       "    0.02566836029291153,\n",
       "    0.013968421146273613,\n",
       "    0.009813647717237473,\n",
       "    0.030501211062073708,\n",
       "    0.010423918254673481,\n",
       "    -0.019614966586232185,\n",
       "    -0.0053105889819562435,\n",
       "    -0.0031422781758010387,\n",
       "    0.0015310707967728376,\n",
       "    0.0005231993272900581,\n",
       "    0.006836265791207552,\n",
       "    -0.017038267105817795,\n",
       "    -0.015349235385656357,\n",
       "    -0.0023963917046785355,\n",
       "    -0.0052119591273367405,\n",
       "    -0.013771161437034607,\n",
       "    0.00841434020549059,\n",
       "    0.011706103570759296,\n",
       "    -0.01383280474692583,\n",
       "    -0.023264262825250626,\n",
       "    0.008420504629611969,\n",
       "    0.02820807322859764,\n",
       "    -0.005097918678075075,\n",
       "    0.009221870452165604,\n",
       "    -0.004432168789207935,\n",
       "    -0.0013538456987589598,\n",
       "    -0.008821187540888786,\n",
       "    -0.018209494650363922,\n",
       "    -0.017531415447592735,\n",
       "    -0.006515719462186098,\n",
       "    0.0014100954867899418,\n",
       "    -0.004037650302052498,\n",
       "    -0.0010479397606104612,\n",
       "    -0.0020665989723056555,\n",
       "    -0.01573142595589161,\n",
       "    0.0027076913975179195,\n",
       "    0.0019248188473284245,\n",
       "    0.045788802206516266,\n",
       "    0.2357248067855835,\n",
       "    -0.0019448529928922653,\n",
       "    -0.021328656002879143,\n",
       "    0.03493954613804817,\n",
       "    -0.009221870452165604,\n",
       "    0.006491062231361866,\n",
       "    0.0028479304164648056,\n",
       "    0.002624472603201866,\n",
       "    -0.007119826041162014,\n",
       "    -0.0013561573578044772,\n",
       "    -0.016545120626688004,\n",
       "    -0.008593105711042881,\n",
       "    -0.012908152304589748,\n",
       "    0.00035753240808844566,\n",
       "    0.00655886996537447,\n",
       "    -0.025840962305665016,\n",
       "    -0.01018350850790739,\n",
       "    -0.002123619196936488,\n",
       "    -0.01436293963342905,\n",
       "    -0.0011511927004903555,\n",
       "    0.015225948765873909,\n",
       "    -0.01563279516994953,\n",
       "    -0.006836265791207552,\n",
       "    -0.0050239465199410915,\n",
       "    0.036813508719205856,\n",
       "    -0.012957466766238213,\n",
       "    -0.015361564233899117,\n",
       "    0.014560198411345482,\n",
       "    0.008808858692646027,\n",
       "    -0.007113661617040634,\n",
       "    0.0014409171417355537,\n",
       "    0.008457490243017673,\n",
       "    0.006682157050818205,\n",
       "    0.01781497709453106,\n",
       "    -0.018172508105635643,\n",
       "    -0.0062568169087171555,\n",
       "    0.022684814408421516,\n",
       "    -0.014757458120584488,\n",
       "    0.0044260043650865555,\n",
       "    0.029564229771494865,\n",
       "    0.019134147092700005,\n",
       "    0.009579402394592762,\n",
       "    5.3408326493809e-05,\n",
       "    -0.01206980086863041,\n",
       "    0.019787568598985672,\n",
       "    0.022820429876446724,\n",
       "    ...],\n",
       "   'tagline': 'No one stays at the top forever.',\n",
       "   'imdbRating': 8.2,\n",
       "   'id': '16',\n",
       "   'title': 'Casino',\n",
       "   'released': neo4j.time.Date(1995, 11, 22)}}]"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "  MATCH (Casino:Movie {title:\"Casino\"}) \n",
    "  RETURN Casino\n",
    "  \"\"\"\n",
    "graph.query(cypher)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'Casino.released.year': 1995}]"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Return only the released property of the matched Movie node\n",
    "\n",
    "cypher = \"\"\"\n",
    "  MATCH (Casino:Movie {title:\"Casino\"}) \n",
    "  RETURN Casino.released.year\n",
    "  \"\"\"\n",
    "graph.query(cypher)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'Casino.released': neo4j.time.Date(1995, 11, 22),\n",
       "  'Casino.tagline': 'No one stays at the top forever.'}]"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Return two properties\n",
    "cypher = \"\"\"\n",
    "  MATCH (Casino:Movie {title:\"Casino\"}) \n",
    "  RETURN Casino.released, Casino.tagline\n",
    "  \"\"\"\n",
    "\n",
    "graph.query(cypher)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'m.released': neo4j.time.Date(1995, 12, 22),\n",
       "  'm.tagline': 'Terror goes into overtime.'}]"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Return two properties\n",
    "cypher = \"\"\"\n",
    "  MATCH (m:Movie {title:\"Sudden Death\"}) \n",
    "  RETURN m.released, m.tagline\n",
    "  \"\"\"\n",
    "\n",
    "graph.query(cypher)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'nineties.title': 'Toy Story'},\n",
       " {'nineties.title': 'Jumanji'},\n",
       " {'nineties.title': 'Grumpier Old Men'},\n",
       " {'nineties.title': 'Waiting to Exhale'},\n",
       " {'nineties.title': 'Father of the Bride Part II'},\n",
       " {'nineties.title': 'Heat'},\n",
       " {'nineties.title': 'Sabrina'},\n",
       " {'nineties.title': 'Tom and Huck'},\n",
       " {'nineties.title': 'Sudden Death'},\n",
       " {'nineties.title': 'GoldenEye'},\n",
       " {'nineties.title': 'American President, The'},\n",
       " {'nineties.title': 'Dracula: Dead and Loving It'},\n",
       " {'nineties.title': 'Balto'},\n",
       " {'nineties.title': 'Nixon'},\n",
       " {'nineties.title': 'Cutthroat Island'},\n",
       " {'nineties.title': 'Casino'},\n",
       " {'nineties.title': 'Sense and Sensibility'},\n",
       " {'nineties.title': 'Four Rooms'},\n",
       " {'nineties.title': 'Ace Ventura: When Nature Calls'},\n",
       " {'nineties.title': 'Money Train'}]"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Cypher patterns with conditional matching\n",
    "\n",
    "cypher = \"\"\"\n",
    "  MATCH (nineties:Movie) \n",
    "  WHERE nineties.released.year >= 1900\n",
    "    AND nineties.released.year < 2000\n",
    "  RETURN nineties.title\n",
    "  \"\"\"\n",
    "graph.query(cypher)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'actor.name': 'Don Rickles', 'movie.title': 'Toy Story'},\n",
       " {'actor.name': 'Tom Hanks', 'movie.title': 'Toy Story'},\n",
       " {'actor.name': 'Tim Allen', 'movie.title': 'Toy Story'},\n",
       " {'actor.name': 'Jim Varney', 'movie.title': 'Toy Story'},\n",
       " {'actor.name': 'Bradley Pierce', 'movie.title': 'Jumanji'},\n",
       " {'actor.name': 'Robin Williams', 'movie.title': 'Jumanji'},\n",
       " {'actor.name': 'Jonathan Hyde', 'movie.title': 'Jumanji'},\n",
       " {'actor.name': 'Kirsten Dunst', 'movie.title': 'Jumanji'},\n",
       " {'actor.name': 'Sophia Loren', 'movie.title': 'Grumpier Old Men'},\n",
       " {'actor.name': 'Jack Lemmon', 'movie.title': 'Grumpier Old Men'}]"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Pattern matching with multiple nodes\n",
    "\n",
    "cypher = \"\"\"\n",
    "  MATCH (actor:Person)-[:ACTED_IN]->(movie:Movie) \n",
    "  RETURN actor.name, movie.title LIMIT 10\n",
    "  \"\"\"\n",
    "graph.query(cypher)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'tom.name': 'Tom Hanks', 'tomHanksMovies.title': 'Toy Story'}]"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "  MATCH (tom:Person {name: \"Tom Hanks\"})-[:ACTED_IN]->(tomHanksMovies:Movie) \n",
    "  RETURN tom.name,tomHanksMovies.title\n",
    "  \"\"\"\n",
    "graph.query(cypher)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'coActors.name': 'Don Rickles', 'm.title': 'Toy Story'},\n",
       " {'coActors.name': 'Tim Allen', 'm.title': 'Toy Story'},\n",
       " {'coActors.name': 'Jim Varney', 'm.title': 'Toy Story'}]"
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "  MATCH (tom:Person {name:\"Tom Hanks\"})-[:ACTED_IN]->(m)<-[:ACTED_IN]-(coActors) \n",
    "  RETURN coActors.name, m.title\n",
    "  \"\"\"\n",
    "graph.query(cypher)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### **Delete/Add (Proceed with caution)** "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 42,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Delete data from the graph\n",
    "cypher = \"\"\"\n",
    "MATCH (emil:Person {name:\"Emil Eifrem\"})-[actedIn:ACTED_IN]->(movie:Movie)\n",
    "RETURN emil.name, movie.title\n",
    "\"\"\"\n",
    "graph.query(cypher)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 43,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "MATCH (emil:Person {name:\"Emil Eifrem\"})-[actedIn:ACTED_IN]->(movie:Movie)\n",
    "DELETE actedIn\n",
    "\"\"\"\n",
    "graph.query(cypher)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 44,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'andreas': {'name': 'Andreas'}}]"
      ]
     },
     "execution_count": 44,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Adding data to the graph\n",
    "cypher = \"\"\"\n",
    "CREATE (andreas:Person {name:\"Andreas\"})\n",
    "RETURN andreas\n",
    "\"\"\"\n",
    "\n",
    "graph.query(cypher)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 45,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "MATCH (andreas:Person {name:\"Andreas\"}), (emil:Person {name:\"Emil Eifrem\"})\n",
    "MERGE (andreas)-[hasRelationship:WORKS_WITH]->(emil)\n",
    "RETURN andreas, hasRelationship, emil\n",
    "\"\"\"\n",
    "graph.query(cypher)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 46,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 46,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Delete everything in a database\n",
    "cypher = \"\"\"\n",
    "MATCH (n)\n",
    "DETACH DELETE n\n",
    "\"\"\"\n",
    "graph.query(cypher)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 47,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'count(n)': 0}]"
      ]
     },
     "execution_count": 47,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Match all nodes in the graph\n",
    "cypher = \"\"\"\n",
    "  MATCH (n) \n",
    "  RETURN count(n)\n",
    "  \"\"\"\n",
    "result = graph.query(cypher)\n",
    "result"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.0"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
